espressif/esp-idf/components/esp32/include/soc/gpio_reg.h
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_GPIO_REG_H_
#define _SOC_GPIO_REG_H_

#include "soc.h"
#define GPIO_BT_SELECT_REG          (DR_REG_GPIO_BASE + 0x0000)
/* GPIO_BT_SEL : R/W ;bitpos:[31:0] ;default: x ; */
/*description: NA*/
#define GPIO_BT_SEL  0xFFFFFFFF
#define GPIO_BT_SEL_M  ((GPIO_BT_SEL_V)<<(GPIO_BT_SEL_S))
#define GPIO_BT_SEL_V  0xFFFFFFFF
#define GPIO_BT_SEL_S  0

#define GPIO_OUT_REG          (DR_REG_GPIO_BASE + 0x0004)
/* GPIO_OUT_DATA : R/W ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 output value*/
#define GPIO_OUT_DATA  0xFFFFFFFF
#define GPIO_OUT_DATA_M  ((GPIO_OUT_DATA_V)<<(GPIO_OUT_DATA_S))
#define GPIO_OUT_DATA_V  0xFFFFFFFF
#define GPIO_OUT_DATA_S  0

#define GPIO_OUT_W1TS_REG          (DR_REG_GPIO_BASE + 0x0008)
/* GPIO_OUT_DATA_W1TS : R/W ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 output value write 1 to set*/
#define GPIO_OUT_DATA_W1TS  0xFFFFFFFF
#define GPIO_OUT_DATA_W1TS_M  ((GPIO_OUT_DATA_W1TS_V)<<(GPIO_OUT_DATA_W1TS_S))
#define GPIO_OUT_DATA_W1TS_V  0xFFFFFFFF
#define GPIO_OUT_DATA_W1TS_S  0

#define GPIO_OUT_W1TC_REG          (DR_REG_GPIO_BASE + 0x000c)
/* GPIO_OUT_DATA_W1TC : R/W ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 output value write 1 to clear*/
#define GPIO_OUT_DATA_W1TC  0xFFFFFFFF
#define GPIO_OUT_DATA_W1TC_M  ((GPIO_OUT_DATA_W1TC_V)<<(GPIO_OUT_DATA_W1TC_S))
#define GPIO_OUT_DATA_W1TC_V  0xFFFFFFFF
#define GPIO_OUT_DATA_W1TC_S  0

#define GPIO_OUT1_REG          (DR_REG_GPIO_BASE + 0x0010)
/* GPIO_OUT1_DATA : R/W ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 output value*/
#define GPIO_OUT1_DATA  0x000000FF
#define GPIO_OUT1_DATA_M  ((GPIO_OUT1_DATA_V)<<(GPIO_OUT1_DATA_S))
#define GPIO_OUT1_DATA_V  0xFF
#define GPIO_OUT1_DATA_S  0

#define GPIO_OUT1_W1TS_REG          (DR_REG_GPIO_BASE + 0x0014)
/* GPIO_OUT1_DATA_W1TS : R/W ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 output value write 1 to set*/
#define GPIO_OUT1_DATA_W1TS  0x000000FF
#define GPIO_OUT1_DATA_W1TS_M  ((GPIO_OUT1_DATA_W1TS_V)<<(GPIO_OUT1_DATA_W1TS_S))
#define GPIO_OUT1_DATA_W1TS_V  0xFF
#define GPIO_OUT1_DATA_W1TS_S  0

#define GPIO_OUT1_W1TC_REG          (DR_REG_GPIO_BASE + 0x0018)
/* GPIO_OUT1_DATA_W1TC : R/W ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 output value write 1 to clear*/
#define GPIO_OUT1_DATA_W1TC  0x000000FF
#define GPIO_OUT1_DATA_W1TC_M  ((GPIO_OUT1_DATA_W1TC_V)<<(GPIO_OUT1_DATA_W1TC_S))
#define GPIO_OUT1_DATA_W1TC_V  0xFF
#define GPIO_OUT1_DATA_W1TC_S  0

#define GPIO_SDIO_SELECT_REG          (DR_REG_GPIO_BASE + 0x001c)
/* GPIO_SDIO_SEL : R/W ;bitpos:[7:0] ;default: x ; */
/*description: SDIO PADS on/off control from outside*/
#define GPIO_SDIO_SEL  0x000000FF
#define GPIO_SDIO_SEL_M  ((GPIO_SDIO_SEL_V)<<(GPIO_SDIO_SEL_S))
#define GPIO_SDIO_SEL_V  0xFF
#define GPIO_SDIO_SEL_S  0

#define GPIO_ENABLE_REG          (DR_REG_GPIO_BASE + 0x0020)
/* GPIO_ENABLE_DATA : R/W ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 output enable*/
#define GPIO_ENABLE_DATA  0xFFFFFFFF
#define GPIO_ENABLE_DATA_M  ((GPIO_ENABLE_DATA_V)<<(GPIO_ENABLE_DATA_S))
#define GPIO_ENABLE_DATA_V  0xFFFFFFFF
#define GPIO_ENABLE_DATA_S  0

#define GPIO_ENABLE_W1TS_REG          (DR_REG_GPIO_BASE + 0x0024)
/* GPIO_ENABLE_DATA_W1TS : R/W ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 output enable write 1 to set*/
#define GPIO_ENABLE_DATA_W1TS  0xFFFFFFFF
#define GPIO_ENABLE_DATA_W1TS_M  ((GPIO_ENABLE_DATA_W1TS_V)<<(GPIO_ENABLE_DATA_W1TS_S))
#define GPIO_ENABLE_DATA_W1TS_V  0xFFFFFFFF
#define GPIO_ENABLE_DATA_W1TS_S  0

#define GPIO_ENABLE_W1TC_REG          (DR_REG_GPIO_BASE + 0x0028)
/* GPIO_ENABLE_DATA_W1TC : R/W ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 output enable write 1 to clear*/
#define GPIO_ENABLE_DATA_W1TC  0xFFFFFFFF
#define GPIO_ENABLE_DATA_W1TC_M  ((GPIO_ENABLE_DATA_W1TC_V)<<(GPIO_ENABLE_DATA_W1TC_S))
#define GPIO_ENABLE_DATA_W1TC_V  0xFFFFFFFF
#define GPIO_ENABLE_DATA_W1TC_S  0

#define GPIO_ENABLE1_REG          (DR_REG_GPIO_BASE + 0x002c)
/* GPIO_ENABLE1_DATA : R/W ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 output enable*/
#define GPIO_ENABLE1_DATA  0x000000FF
#define GPIO_ENABLE1_DATA_M  ((GPIO_ENABLE1_DATA_V)<<(GPIO_ENABLE1_DATA_S))
#define GPIO_ENABLE1_DATA_V  0xFF
#define GPIO_ENABLE1_DATA_S  0

#define GPIO_ENABLE1_W1TS_REG          (DR_REG_GPIO_BASE + 0x0030)
/* GPIO_ENABLE1_DATA_W1TS : R/W ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 output enable write 1 to set*/
#define GPIO_ENABLE1_DATA_W1TS  0x000000FF
#define GPIO_ENABLE1_DATA_W1TS_M  ((GPIO_ENABLE1_DATA_W1TS_V)<<(GPIO_ENABLE1_DATA_W1TS_S))
#define GPIO_ENABLE1_DATA_W1TS_V  0xFF
#define GPIO_ENABLE1_DATA_W1TS_S  0

#define GPIO_ENABLE1_W1TC_REG          (DR_REG_GPIO_BASE + 0x0034)
/* GPIO_ENABLE1_DATA_W1TC : R/W ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 output enable write 1 to clear*/
#define GPIO_ENABLE1_DATA_W1TC  0x000000FF
#define GPIO_ENABLE1_DATA_W1TC_M  ((GPIO_ENABLE1_DATA_W1TC_V)<<(GPIO_ENABLE1_DATA_W1TC_S))
#define GPIO_ENABLE1_DATA_W1TC_V  0xFF
#define GPIO_ENABLE1_DATA_W1TC_S  0

#define GPIO_STRAP_REG          (DR_REG_GPIO_BASE + 0x0038)
/* GPIO_STRAPPING : RO ;bitpos:[15:0] ;default:  ; */
/*description: GPIO strapping results: {2'd0  boot_sel_dig[7:1]  vsdio_boot_sel
  boot_sel_chip[5:0]}.   Boot_sel_dig[7:1]: {U0RXD  SD_CLK  SD_CMD  SD_DATA0  SD_DATA1  SD_DATA2  SD_DATA3}.  vsdio_boot_sel: MTDI. boot_sel_chip[5:0]: {GPIO0  U0TXD  GPIO2  GPIO4  MTDO  GPIO5}*/
#define GPIO_STRAPPING  0x0000FFFF
#define GPIO_STRAPPING_M  ((GPIO_STRAPPING_V)<<(GPIO_STRAPPING_S))
#define GPIO_STRAPPING_V  0xFFFF
#define GPIO_STRAPPING_S  0

#define GPIO_IN_REG          (DR_REG_GPIO_BASE + 0x003c)
/* GPIO_IN_DATA : RO ;bitpos:[31:0] ;default:  ; */
/*description: GPIO0~31 input value*/
#define GPIO_IN_DATA  0xFFFFFFFF
#define GPIO_IN_DATA_M  ((GPIO_IN_DATA_V)<<(GPIO_IN_DATA_S))
#define GPIO_IN_DATA_V  0xFFFFFFFF
#define GPIO_IN_DATA_S  0

