espressif/esp-idf/components/esp32/include/soc/gpio_reg.h
#define GPIO_IN1_REG          (DR_REG_GPIO_BASE + 0x0040)
/* GPIO_IN1_DATA : RO ;bitpos:[7:0] ;default:  ; */
/*description: GPIO32~39 input value*/
#define GPIO_IN1_DATA  0x000000FF
#define GPIO_IN1_DATA_M  ((GPIO_IN1_DATA_V)<<(GPIO_IN1_DATA_S))
#define GPIO_IN1_DATA_V  0xFF
#define GPIO_IN1_DATA_S  0

#define GPIO_STATUS_REG          (DR_REG_GPIO_BASE + 0x0044)
/* GPIO_STATUS_INT : R/W ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 interrupt status*/
#define GPIO_STATUS_INT  0xFFFFFFFF
#define GPIO_STATUS_INT_M  ((GPIO_STATUS_INT_V)<<(GPIO_STATUS_INT_S))
#define GPIO_STATUS_INT_V  0xFFFFFFFF
#define GPIO_STATUS_INT_S  0

#define GPIO_STATUS_W1TS_REG          (DR_REG_GPIO_BASE + 0x0048)
/* GPIO_STATUS_INT_W1TS : R/W ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 interrupt status write 1 to set*/
#define GPIO_STATUS_INT_W1TS  0xFFFFFFFF
#define GPIO_STATUS_INT_W1TS_M  ((GPIO_STATUS_INT_W1TS_V)<<(GPIO_STATUS_INT_W1TS_S))
#define GPIO_STATUS_INT_W1TS_V  0xFFFFFFFF
#define GPIO_STATUS_INT_W1TS_S  0

#define GPIO_STATUS_W1TC_REG          (DR_REG_GPIO_BASE + 0x004c)
/* GPIO_STATUS_INT_W1TC : R/W ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 interrupt status write 1 to clear*/
#define GPIO_STATUS_INT_W1TC  0xFFFFFFFF
#define GPIO_STATUS_INT_W1TC_M  ((GPIO_STATUS_INT_W1TC_V)<<(GPIO_STATUS_INT_W1TC_S))
#define GPIO_STATUS_INT_W1TC_V  0xFFFFFFFF
#define GPIO_STATUS_INT_W1TC_S  0

#define GPIO_STATUS1_REG          (DR_REG_GPIO_BASE + 0x0050)
/* GPIO_STATUS1_INT : R/W ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 interrupt status*/
#define GPIO_STATUS1_INT  0x000000FF
#define GPIO_STATUS1_INT_M  ((GPIO_STATUS1_INT_V)<<(GPIO_STATUS1_INT_S))
#define GPIO_STATUS1_INT_V  0xFF
#define GPIO_STATUS1_INT_S  0

#define GPIO_STATUS1_W1TS_REG          (DR_REG_GPIO_BASE + 0x0054)
/* GPIO_STATUS1_INT_W1TS : R/W ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 interrupt status write 1 to set*/
#define GPIO_STATUS1_INT_W1TS  0x000000FF
#define GPIO_STATUS1_INT_W1TS_M  ((GPIO_STATUS1_INT_W1TS_V)<<(GPIO_STATUS1_INT_W1TS_S))
#define GPIO_STATUS1_INT_W1TS_V  0xFF
#define GPIO_STATUS1_INT_W1TS_S  0

#define GPIO_STATUS1_W1TC_REG          (DR_REG_GPIO_BASE + 0x0058)
/* GPIO_STATUS1_INT_W1TC : R/W ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 interrupt status write 1 to clear*/
#define GPIO_STATUS1_INT_W1TC  0x000000FF
#define GPIO_STATUS1_INT_W1TC_M  ((GPIO_STATUS1_INT_W1TC_V)<<(GPIO_STATUS1_INT_W1TC_S))
#define GPIO_STATUS1_INT_W1TC_V  0xFF
#define GPIO_STATUS1_INT_W1TC_S  0

#define GPIO_ACPU_INT_REG          (DR_REG_GPIO_BASE + 0x0060)
/* GPIO_APPCPU_INT : RO ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 APP CPU interrupt status*/
#define GPIO_APPCPU_INT  0xFFFFFFFF
#define GPIO_APPCPU_INT_M  ((GPIO_APPCPU_INT_V)<<(GPIO_APPCPU_INT_S))
#define GPIO_APPCPU_INT_V  0xFFFFFFFF
#define GPIO_APPCPU_INT_S  0

#define GPIO_ACPU_NMI_INT_REG          (DR_REG_GPIO_BASE + 0x0064)
/* GPIO_APPCPU_NMI_INT : RO ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 APP CPU non-maskable interrupt status*/
#define GPIO_APPCPU_NMI_INT  0xFFFFFFFF
#define GPIO_APPCPU_NMI_INT_M  ((GPIO_APPCPU_NMI_INT_V)<<(GPIO_APPCPU_NMI_INT_S))
#define GPIO_APPCPU_NMI_INT_V  0xFFFFFFFF
#define GPIO_APPCPU_NMI_INT_S  0

#define GPIO_PCPU_INT_REG          (DR_REG_GPIO_BASE + 0x0068)
/* GPIO_PROCPU_INT : RO ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 PRO CPU interrupt status*/
#define GPIO_PROCPU_INT  0xFFFFFFFF
#define GPIO_PROCPU_INT_M  ((GPIO_PROCPU_INT_V)<<(GPIO_PROCPU_INT_S))
#define GPIO_PROCPU_INT_V  0xFFFFFFFF
#define GPIO_PROCPU_INT_S  0

#define GPIO_PCPU_NMI_INT_REG          (DR_REG_GPIO_BASE + 0x006c)
/* GPIO_PROCPU_NMI_INT : RO ;bitpos:[31:0] ;default: x ; */
/*description: GPIO0~31 PRO CPU non-maskable interrupt status*/
#define GPIO_PROCPU_NMI_INT  0xFFFFFFFF
#define GPIO_PROCPU_NMI_INT_M  ((GPIO_PROCPU_NMI_INT_V)<<(GPIO_PROCPU_NMI_INT_S))
#define GPIO_PROCPU_NMI_INT_V  0xFFFFFFFF
#define GPIO_PROCPU_NMI_INT_S  0

#define GPIO_CPUSDIO_INT_REG          (DR_REG_GPIO_BASE + 0x0070)
/* GPIO_SDIO_INT : RO ;bitpos:[31:0] ;default: x ; */
/*description: SDIO's extent GPIO0~31 interrupt*/
#define GPIO_SDIO_INT  0xFFFFFFFF
#define GPIO_SDIO_INT_M  ((GPIO_SDIO_INT_V)<<(GPIO_SDIO_INT_S))
#define GPIO_SDIO_INT_V  0xFFFFFFFF
#define GPIO_SDIO_INT_S  0

#define GPIO_ACPU_INT1_REG          (DR_REG_GPIO_BASE + 0x0074)
/* GPIO_APPCPU_INT_H : RO ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 APP CPU interrupt status*/
#define GPIO_APPCPU_INT_H  0x000000FF
#define GPIO_APPCPU_INT_H_M  ((GPIO_APPCPU_INT_H_V)<<(GPIO_APPCPU_INT_H_S))
#define GPIO_APPCPU_INT_H_V  0xFF
#define GPIO_APPCPU_INT_H_S  0

#define GPIO_ACPU_NMI_INT1_REG          (DR_REG_GPIO_BASE + 0x0078)
/* GPIO_APPCPU_NMI_INT_H : RO ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 APP CPU non-maskable interrupt status*/
#define GPIO_APPCPU_NMI_INT_H  0x000000FF
#define GPIO_APPCPU_NMI_INT_H_M  ((GPIO_APPCPU_NMI_INT_H_V)<<(GPIO_APPCPU_NMI_INT_H_S))
#define GPIO_APPCPU_NMI_INT_H_V  0xFF
#define GPIO_APPCPU_NMI_INT_H_S  0

#define GPIO_PCPU_INT1_REG          (DR_REG_GPIO_BASE + 0x007c)
/* GPIO_PROCPU_INT_H : RO ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 PRO CPU interrupt status*/
#define GPIO_PROCPU_INT_H  0x000000FF
#define GPIO_PROCPU_INT_H_M  ((GPIO_PROCPU_INT_H_V)<<(GPIO_PROCPU_INT_H_S))
#define GPIO_PROCPU_INT_H_V  0xFF
#define GPIO_PROCPU_INT_H_S  0

#define GPIO_PCPU_NMI_INT1_REG          (DR_REG_GPIO_BASE + 0x0080)
/* GPIO_PROCPU_NMI_INT_H : RO ;bitpos:[7:0] ;default: x ; */
/*description: GPIO32~39 PRO CPU non-maskable interrupt status*/
#define GPIO_PROCPU_NMI_INT_H  0x000000FF
#define GPIO_PROCPU_NMI_INT_H_M  ((GPIO_PROCPU_NMI_INT_H_V)<<(GPIO_PROCPU_NMI_INT_H_S))
#define GPIO_PROCPU_NMI_INT_H_V  0xFF
#define GPIO_PROCPU_NMI_INT_H_S  0

#define GPIO_CPUSDIO_INT1_REG          (DR_REG_GPIO_BASE + 0x0084)
/* GPIO_SDIO_INT_H : RO ;bitpos:[7:0] ;default: x ; */
/*description: SDIO's extent GPIO32~39 interrupt*/
#define GPIO_SDIO_INT_H  0x000000FF
#define GPIO_SDIO_INT_H_M  ((GPIO_SDIO_INT_H_V)<<(GPIO_SDIO_INT_H_S))
#define GPIO_SDIO_INT_H_V  0xFF
#define GPIO_SDIO_INT_H_S  0

#define GPIO_PIN0_REG          (DR_REG_GPIO_BASE + 0x0088)
/* GPIO_PIN0_INT_ENA : R/W ;bitpos:[17:13] ;default: x ; */
/*description: bit0: APP CPU interrupt enable  bit1: APP CPU non-maskable interrupt
 enable  bit3: PRO CPU interrupt enable  bit4:  PRO CPU non-maskable interrupt enable  bit5: SDIO's extent interrupt enable*/
#define GPIO_PIN0_INT_ENA  0x0000001F
#define GPIO_PIN0_INT_ENA_M  ((GPIO_PIN0_INT_ENA_V)<<(GPIO_PIN0_INT_ENA_S))
#define GPIO_PIN0_INT_ENA_V  0x1F
#define GPIO_PIN0_INT_ENA_S  13
/* GPIO_PIN0_CONFIG : R/W ;bitpos:[12:11] ;default: x ; */
/*description: NA*/
#define GPIO_PIN0_CONFIG  0x00000003
#define GPIO_PIN0_CONFIG_M  ((GPIO_PIN0_CONFIG_V)<<(GPIO_PIN0_CONFIG_S))
#define GPIO_PIN0_CONFIG_V  0x3
#define GPIO_PIN0_CONFIG_S  11
/* GPIO_PIN0_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: x ; */
/*description: GPIO wake up enable  only available in light sleep*/
#define GPIO_PIN0_WAKEUP_ENABLE  (BIT(10))
#define GPIO_PIN0_WAKEUP_ENABLE_M  (BIT(10))
#define GPIO_PIN0_WAKEUP_ENABLE_V  0x1
#define GPIO_PIN0_WAKEUP_ENABLE_S  10
/* GPIO_PIN0_INT_TYPE : R/W ;bitpos:[9:7] ;default: x ; */
/*description: if set to 0: GPIO interrupt disable  if set to 1: rising edge
 trigger  if set to 2: falling edge trigger  if set to 3: any edge trigger  if set to 4: low level trigger  if set to 5: high level trigger*/
#define GPIO_PIN0_INT_TYPE  0x00000007
#define GPIO_PIN0_INT_TYPE_M  ((GPIO_PIN0_INT_TYPE_V)<<(GPIO_PIN0_INT_TYPE_S))
#define GPIO_PIN0_INT_TYPE_V  0x7
#define GPIO_PIN0_INT_TYPE_S  7
/* GPIO_PIN0_PAD_DRIVER : R/W ;bitpos:[2] ;default: x ; */
/*description: if set to 0: normal output  if set to 1: open drain*/
#define GPIO_PIN0_PAD_DRIVER  (BIT(2))
#define GPIO_PIN0_PAD_DRIVER_M  (BIT(2))
#define GPIO_PIN0_PAD_DRIVER_V  0x1
#define GPIO_PIN0_PAD_DRIVER_S  2

