espressif/esp-idf/components/esp32/include/soc/gpio_reg.h
#define GPIO_FUNC68_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x0240)
/* GPIO_SIG68_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG68_IN_SEL  (BIT(7))
#define GPIO_SIG68_IN_SEL_M  (BIT(7))
#define GPIO_SIG68_IN_SEL_V  0x1
#define GPIO_SIG68_IN_SEL_S  7
/* GPIO_FUNC68_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC68_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC68_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC68_IN_INV_SEL_V  0x1
#define GPIO_FUNC68_IN_INV_SEL_S  6
/* GPIO_FUNC68_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC68_IN_SEL  0x0000003F
#define GPIO_FUNC68_IN_SEL_M  ((GPIO_FUNC68_IN_SEL_V)<<(GPIO_FUNC68_IN_SEL_S))
#define GPIO_FUNC68_IN_SEL_V  0x3F
#define GPIO_FUNC68_IN_SEL_S  0

#define GPIO_FUNC69_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x0244)
/* GPIO_SIG69_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG69_IN_SEL  (BIT(7))
#define GPIO_SIG69_IN_SEL_M  (BIT(7))
#define GPIO_SIG69_IN_SEL_V  0x1
#define GPIO_SIG69_IN_SEL_S  7
/* GPIO_FUNC69_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC69_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC69_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC69_IN_INV_SEL_V  0x1
#define GPIO_FUNC69_IN_INV_SEL_S  6
/* GPIO_FUNC69_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC69_IN_SEL  0x0000003F
#define GPIO_FUNC69_IN_SEL_M  ((GPIO_FUNC69_IN_SEL_V)<<(GPIO_FUNC69_IN_SEL_S))
#define GPIO_FUNC69_IN_SEL_V  0x3F
#define GPIO_FUNC69_IN_SEL_S  0

#define GPIO_FUNC70_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x0248)
/* GPIO_SIG70_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG70_IN_SEL  (BIT(7))
#define GPIO_SIG70_IN_SEL_M  (BIT(7))
#define GPIO_SIG70_IN_SEL_V  0x1
#define GPIO_SIG70_IN_SEL_S  7
/* GPIO_FUNC70_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC70_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC70_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC70_IN_INV_SEL_V  0x1
#define GPIO_FUNC70_IN_INV_SEL_S  6
/* GPIO_FUNC70_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC70_IN_SEL  0x0000003F
#define GPIO_FUNC70_IN_SEL_M  ((GPIO_FUNC70_IN_SEL_V)<<(GPIO_FUNC70_IN_SEL_S))
#define GPIO_FUNC70_IN_SEL_V  0x3F
#define GPIO_FUNC70_IN_SEL_S  0

#define GPIO_FUNC71_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x024c)
/* GPIO_SIG71_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG71_IN_SEL  (BIT(7))
#define GPIO_SIG71_IN_SEL_M  (BIT(7))
#define GPIO_SIG71_IN_SEL_V  0x1
#define GPIO_SIG71_IN_SEL_S  7
/* GPIO_FUNC71_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC71_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC71_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC71_IN_INV_SEL_V  0x1
#define GPIO_FUNC71_IN_INV_SEL_S  6
/* GPIO_FUNC71_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC71_IN_SEL  0x0000003F
#define GPIO_FUNC71_IN_SEL_M  ((GPIO_FUNC71_IN_SEL_V)<<(GPIO_FUNC71_IN_SEL_S))
#define GPIO_FUNC71_IN_SEL_V  0x3F
#define GPIO_FUNC71_IN_SEL_S  0

#define GPIO_FUNC72_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x0250)
/* GPIO_SIG72_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG72_IN_SEL  (BIT(7))
#define GPIO_SIG72_IN_SEL_M  (BIT(7))
#define GPIO_SIG72_IN_SEL_V  0x1
#define GPIO_SIG72_IN_SEL_S  7
/* GPIO_FUNC72_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC72_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC72_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC72_IN_INV_SEL_V  0x1
#define GPIO_FUNC72_IN_INV_SEL_S  6
/* GPIO_FUNC72_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC72_IN_SEL  0x0000003F
#define GPIO_FUNC72_IN_SEL_M  ((GPIO_FUNC72_IN_SEL_V)<<(GPIO_FUNC72_IN_SEL_S))
#define GPIO_FUNC72_IN_SEL_V  0x3F
#define GPIO_FUNC72_IN_SEL_S  0

#define GPIO_FUNC73_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x0254)
/* GPIO_SIG73_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG73_IN_SEL  (BIT(7))
#define GPIO_SIG73_IN_SEL_M  (BIT(7))
#define GPIO_SIG73_IN_SEL_V  0x1
#define GPIO_SIG73_IN_SEL_S  7
/* GPIO_FUNC73_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC73_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC73_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC73_IN_INV_SEL_V  0x1
#define GPIO_FUNC73_IN_INV_SEL_S  6
/* GPIO_FUNC73_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC73_IN_SEL  0x0000003F
#define GPIO_FUNC73_IN_SEL_M  ((GPIO_FUNC73_IN_SEL_V)<<(GPIO_FUNC73_IN_SEL_S))
#define GPIO_FUNC73_IN_SEL_V  0x3F
#define GPIO_FUNC73_IN_SEL_S  0

#define GPIO_FUNC74_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x0258)
/* GPIO_SIG74_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG74_IN_SEL  (BIT(7))
#define GPIO_SIG74_IN_SEL_M  (BIT(7))
#define GPIO_SIG74_IN_SEL_V  0x1
#define GPIO_SIG74_IN_SEL_S  7
/* GPIO_FUNC74_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC74_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC74_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC74_IN_INV_SEL_V  0x1
#define GPIO_FUNC74_IN_INV_SEL_S  6
/* GPIO_FUNC74_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC74_IN_SEL  0x0000003F
#define GPIO_FUNC74_IN_SEL_M  ((GPIO_FUNC74_IN_SEL_V)<<(GPIO_FUNC74_IN_SEL_S))
#define GPIO_FUNC74_IN_SEL_V  0x3F
#define GPIO_FUNC74_IN_SEL_S  0

