espressif/esp-idf/components/esp32/include/soc/gpio_reg.h
#define GPIO_FUNC239_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x04ec)
/* GPIO_SIG239_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG239_IN_SEL  (BIT(7))
#define GPIO_SIG239_IN_SEL_M  (BIT(7))
#define GPIO_SIG239_IN_SEL_V  0x1
#define GPIO_SIG239_IN_SEL_S  7
/* GPIO_FUNC239_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC239_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC239_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC239_IN_INV_SEL_V  0x1
#define GPIO_FUNC239_IN_INV_SEL_S  6
/* GPIO_FUNC239_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC239_IN_SEL  0x0000003F
#define GPIO_FUNC239_IN_SEL_M  ((GPIO_FUNC239_IN_SEL_V)<<(GPIO_FUNC239_IN_SEL_S))
#define GPIO_FUNC239_IN_SEL_V  0x3F
#define GPIO_FUNC239_IN_SEL_S  0

#define GPIO_FUNC240_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x04f0)
/* GPIO_SIG240_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG240_IN_SEL  (BIT(7))
#define GPIO_SIG240_IN_SEL_M  (BIT(7))
#define GPIO_SIG240_IN_SEL_V  0x1
#define GPIO_SIG240_IN_SEL_S  7
/* GPIO_FUNC240_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC240_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC240_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC240_IN_INV_SEL_V  0x1
#define GPIO_FUNC240_IN_INV_SEL_S  6
/* GPIO_FUNC240_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC240_IN_SEL  0x0000003F
#define GPIO_FUNC240_IN_SEL_M  ((GPIO_FUNC240_IN_SEL_V)<<(GPIO_FUNC240_IN_SEL_S))
#define GPIO_FUNC240_IN_SEL_V  0x3F
#define GPIO_FUNC240_IN_SEL_S  0

#define GPIO_FUNC241_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x04f4)
/* GPIO_SIG241_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG241_IN_SEL  (BIT(7))
#define GPIO_SIG241_IN_SEL_M  (BIT(7))
#define GPIO_SIG241_IN_SEL_V  0x1
#define GPIO_SIG241_IN_SEL_S  7
/* GPIO_FUNC241_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC241_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC241_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC241_IN_INV_SEL_V  0x1
#define GPIO_FUNC241_IN_INV_SEL_S  6
/* GPIO_FUNC241_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC241_IN_SEL  0x0000003F
#define GPIO_FUNC241_IN_SEL_M  ((GPIO_FUNC241_IN_SEL_V)<<(GPIO_FUNC241_IN_SEL_S))
#define GPIO_FUNC241_IN_SEL_V  0x3F
#define GPIO_FUNC241_IN_SEL_S  0

#define GPIO_FUNC242_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x04f8)
/* GPIO_SIG242_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG242_IN_SEL  (BIT(7))
#define GPIO_SIG242_IN_SEL_M  (BIT(7))
#define GPIO_SIG242_IN_SEL_V  0x1
#define GPIO_SIG242_IN_SEL_S  7
/* GPIO_FUNC242_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC242_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC242_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC242_IN_INV_SEL_V  0x1
#define GPIO_FUNC242_IN_INV_SEL_S  6
/* GPIO_FUNC242_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC242_IN_SEL  0x0000003F
#define GPIO_FUNC242_IN_SEL_M  ((GPIO_FUNC242_IN_SEL_V)<<(GPIO_FUNC242_IN_SEL_S))
#define GPIO_FUNC242_IN_SEL_V  0x3F
#define GPIO_FUNC242_IN_SEL_S  0

#define GPIO_FUNC243_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x04fc)
/* GPIO_SIG243_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG243_IN_SEL  (BIT(7))
#define GPIO_SIG243_IN_SEL_M  (BIT(7))
#define GPIO_SIG243_IN_SEL_V  0x1
#define GPIO_SIG243_IN_SEL_S  7
/* GPIO_FUNC243_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC243_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC243_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC243_IN_INV_SEL_V  0x1
#define GPIO_FUNC243_IN_INV_SEL_S  6
/* GPIO_FUNC243_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC243_IN_SEL  0x0000003F
#define GPIO_FUNC243_IN_SEL_M  ((GPIO_FUNC243_IN_SEL_V)<<(GPIO_FUNC243_IN_SEL_S))
#define GPIO_FUNC243_IN_SEL_V  0x3F
#define GPIO_FUNC243_IN_SEL_S  0

#define GPIO_FUNC244_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x0500)
/* GPIO_SIG244_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG244_IN_SEL  (BIT(7))
#define GPIO_SIG244_IN_SEL_M  (BIT(7))
#define GPIO_SIG244_IN_SEL_V  0x1
#define GPIO_SIG244_IN_SEL_S  7
/* GPIO_FUNC244_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC244_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC244_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC244_IN_INV_SEL_V  0x1
#define GPIO_FUNC244_IN_INV_SEL_S  6
/* GPIO_FUNC244_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC244_IN_SEL  0x0000003F
#define GPIO_FUNC244_IN_SEL_M  ((GPIO_FUNC244_IN_SEL_V)<<(GPIO_FUNC244_IN_SEL_S))
#define GPIO_FUNC244_IN_SEL_V  0x3F
#define GPIO_FUNC244_IN_SEL_S  0

#define GPIO_FUNC245_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x0504)
/* GPIO_SIG245_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG245_IN_SEL  (BIT(7))
#define GPIO_SIG245_IN_SEL_M  (BIT(7))
#define GPIO_SIG245_IN_SEL_V  0x1
#define GPIO_SIG245_IN_SEL_S  7
/* GPIO_FUNC245_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC245_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC245_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC245_IN_INV_SEL_V  0x1
#define GPIO_FUNC245_IN_INV_SEL_S  6
/* GPIO_FUNC245_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC245_IN_SEL  0x0000003F
#define GPIO_FUNC245_IN_SEL_M  ((GPIO_FUNC245_IN_SEL_V)<<(GPIO_FUNC245_IN_SEL_S))
#define GPIO_FUNC245_IN_SEL_V  0x3F
#define GPIO_FUNC245_IN_SEL_S  0

#define GPIO_FUNC246_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x0508)
/* GPIO_SIG246_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG246_IN_SEL  (BIT(7))
#define GPIO_SIG246_IN_SEL_M  (BIT(7))
#define GPIO_SIG246_IN_SEL_V  0x1
#define GPIO_SIG246_IN_SEL_S  7
/* GPIO_FUNC246_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC246_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC246_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC246_IN_INV_SEL_V  0x1
#define GPIO_FUNC246_IN_INV_SEL_S  6
/* GPIO_FUNC246_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC246_IN_SEL  0x0000003F
#define GPIO_FUNC246_IN_SEL_M  ((GPIO_FUNC246_IN_SEL_V)<<(GPIO_FUNC246_IN_SEL_S))
#define GPIO_FUNC246_IN_SEL_V  0x3F
#define GPIO_FUNC246_IN_SEL_S  0

#define GPIO_FUNC247_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x050c)
/* GPIO_SIG247_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG247_IN_SEL  (BIT(7))
#define GPIO_SIG247_IN_SEL_M  (BIT(7))
#define GPIO_SIG247_IN_SEL_V  0x1
#define GPIO_SIG247_IN_SEL_S  7
/* GPIO_FUNC247_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC247_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC247_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC247_IN_INV_SEL_V  0x1
#define GPIO_FUNC247_IN_INV_SEL_S  6
/* GPIO_FUNC247_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC247_IN_SEL  0x0000003F
#define GPIO_FUNC247_IN_SEL_M  ((GPIO_FUNC247_IN_SEL_V)<<(GPIO_FUNC247_IN_SEL_S))
#define GPIO_FUNC247_IN_SEL_V  0x3F
#define GPIO_FUNC247_IN_SEL_S  0

#define GPIO_FUNC248_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x0510)
/* GPIO_SIG248_IN_SEL : R/W ;bitpos:[7] ;default: x ; */
/*description: if the slow signal bypass the io matrix or not if you want  setting
 the value to 1*/
#define GPIO_SIG248_IN_SEL  (BIT(7))
#define GPIO_SIG248_IN_SEL_M  (BIT(7))
#define GPIO_SIG248_IN_SEL_V  0x1
#define GPIO_SIG248_IN_SEL_S  7
/* GPIO_FUNC248_IN_INV_SEL : R/W ;bitpos:[6] ;default: x ; */
/*description: revert the value of the input if you want to revert  please set the value to 1*/
#define GPIO_FUNC248_IN_INV_SEL  (BIT(6))
#define GPIO_FUNC248_IN_INV_SEL_M  (BIT(6))
#define GPIO_FUNC248_IN_INV_SEL_V  0x1
#define GPIO_FUNC248_IN_INV_SEL_S  6
/* GPIO_FUNC248_IN_SEL : R/W ;bitpos:[5:0] ;default: x ; */
/*description: select one of the 256 inputs*/
#define GPIO_FUNC248_IN_SEL  0x0000003F
#define GPIO_FUNC248_IN_SEL_M  ((GPIO_FUNC248_IN_SEL_V)<<(GPIO_FUNC248_IN_SEL_S))
#define GPIO_FUNC248_IN_SEL_V  0x3F
#define GPIO_FUNC248_IN_SEL_S  0

